# Aula 1 - Pandas na prática!

Na aula de hoje, vamos explorar os seguintes tópicos em Python:

- 1) Pandas

___

## 1) Pandas

O **[Pandas](https://pandas.pydata.org/)** é uma das bibliotecas mais usadas em data science.

Esta biblioteca, construída a partir do Numpy, possibilita a estruturação e manipulação de dados de maneira simples e eficiente.

Comos os dados são a matéria prima de todo projeto de data science, manipulá-los é fundamental! Por isso, utilizaremos o Pandas em quase todas as aulas daqui pra frente!

In [1]:
import pandas as pd

### DataFrame

O objeto do Pandas que mais utilizaremos será o **DataFrame**

Como veremos a seguir, o DataFrame é uma estrutura que se assemalha a uma **tabela**.

___

### Lendo dados de um arquivo

A forma mais comum de se construir um dataframe é a partir da **leitura de um arquivo**

Em geral, queremos ler arquivos já estruturados como base de dados, em formatos como .csv, .txt, .xlsx, etc.

O pandas é capaz de ler todos esses formatos, com funções específicas!

_______

**Exemplo 1:** lista de arquivos (módulo 1)

1. Faça um programa que imprima as linhas do arquivo alunos.csv

In [2]:
# # não recomendado - caminhos absolutos
# pd.read_csv("C:/Users/Andre/Google Drive/_lets_code/pi_ds/674/módulo 3/datasets/alunos.csv", sep=";")

df = pd.read_csv("../datasets/alunos.csv", sep=";")

In [19]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [3]:
print(df)

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [4]:
for col in df:
    
    print(col)

RA
Nome
Frequencia
Prova_1
Prova_2
Prova_3
Prova_4

In [23]:
df.columns.tolist()

['RA', 'Nome', 'Frequencia', 'Prova_1', 'Prova_2', 'Prova_3', 'Prova_4']

In [5]:
df.index.tolist()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [6]:
df.head(3)

       RA            Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201  Antonio Carlos          20      6.5      8.5      7.0        6
1  110212     Ana Beatriz          20      7.0      7.0      7.0        8
2  110218   Carlos Vernes          17      7.0      7.0      7.0        7

In [34]:
df.tail(3)

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df["Frequencia"]

0    20
1    20
2    17
3    20
4    15
5    18
6    20
7    20
8    19
9    20
Name: Frequencia, dtype: int64

In [9]:
df["RA"]

0    110201
1    110212
2    110218
3    110307
4    110275
5    110281
6    110301
7    110263
8    110271
9    110236
Name: RA, dtype: int64

In [10]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [11]:
df.shape

(10, 7)

In [51]:
df.shape[0]

10

In [57]:
df.head(1)

       RA            Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201  Antonio Carlos          20      6.5      8.5      7.0        6

In [13]:
df.loc[3].values

array([110307, 'Francisco Cunha', 20, 9.0, 8.5, 8.5, 10], dtype=object)

In [14]:
for i in range(df.shape[0]):
    
    print(df.loc[i].values)

[110201 'Antonio Carlos' 20 6.5 8.5 7.0 6]
[110212 'Ana Beatriz' 20 7.0 7.0 7.0 8]
[110218 'Carlos Vernes' 17 7.0 7.0 7.0 7]
[110307 'Francisco Cunha' 20 9.0 8.5 8.5 10]
[110275 'Sandra Rosa' 15 6.5 7.5 7.0 7]
[110281 'Juliana Arruda' 18 7.5 7.0 7.5 8]
[110301 'Joao Galo' 20 5.0 6.5 7.0 5]
[110263 'José Valente' 20 10.0 10.0 10.0 10]
[110271 'Maria Ferreira' 19 9.5 8.0 7.0 10]
[110236 'Adriana Tavares' 20 8.0 8.0 8.0 8]

# RESPOSTA FINAL

In [15]:
df = pd.read_csv("../datasets/alunos.csv", sep=";")

for i in range(df.shape[0]):
    
    print("\t".join([str(x) for x in df.loc[i].values]))

110201	Antonio Carlos	20	6.5	8.5	7.0	6
110212	Ana Beatriz	20	7.0	7.0	7.0	8
110218	Carlos Vernes	17	7.0	7.0	7.0	7
110307	Francisco Cunha	20	9.0	8.5	8.5	10
110275	Sandra Rosa	15	6.5	7.5	7.0	7
110281	Juliana Arruda	18	7.5	7.0	7.5	8
110301	Joao Galo	20	5.0	6.5	7.0	5
110263	José Valente	20	10.0	10.0	10.0	10
110271	Maria Ferreira	19	9.5	8.0	7.0	10
110236	Adriana Tavares	20	8.0	8.0	8.0	8

_______

2. Faça um programa que imprima as linhas do arquivo alunos.csv como listas.

In [16]:
df = pd.read_csv("../datasets/alunos.csv", sep=";")

for i in range(df.shape[0]):
    
    print(df.loc[i].values.tolist())

[110201, 'Antonio Carlos', 20, 6.5, 8.5, 7.0, 6]
[110212, 'Ana Beatriz', 20, 7.0, 7.0, 7.0, 8]
[110218, 'Carlos Vernes', 17, 7.0, 7.0, 7.0, 7]
[110307, 'Francisco Cunha', 20, 9.0, 8.5, 8.5, 10]
[110275, 'Sandra Rosa', 15, 6.5, 7.5, 7.0, 7]
[110281, 'Juliana Arruda', 18, 7.5, 7.0, 7.5, 8]
[110301, 'Joao Galo', 20, 5.0, 6.5, 7.0, 5]
[110263, 'José Valente', 20, 10.0, 10.0, 10.0, 10]
[110271, 'Maria Ferreira', 19, 9.5, 8.0, 7.0, 10]
[110236, 'Adriana Tavares', 20, 8.0, 8.0, 8.0, 8]

3. Faça um programa que imprima os elementos da coluna ‘Nome’ do arquivo alunos.csv.

In [17]:
df["Nome"][3:5]

3    Francisco Cunha
4        Sandra Rosa
Name: Nome, dtype: object

In [78]:
for nome in df["Nome"].values:
    
    print(nome)

Antonio Carlos
Ana Beatriz
Carlos Vernes
Francisco Cunha
Sandra Rosa
Juliana Arruda
Joao Galo
José Valente
Maria Ferreira
Adriana Tavares

4. Faça um programa que copie os dados do arquivo alunos.csv para um arquivo chamado alunos2.csv

In [93]:
df

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7
5  110281   Juliana Arruda          18      7.5      7.0      7.5        8
6  110301        Joao Galo          20      5.0      6.5      7.0        5
7  110263     José Valente          20     10.0     10.0     10.0       10
8  110271   Maria Ferreira          19      9.5      8.0      7.0       10
9  110236  Adriana Tavares          20      8.0      8.0      8.0        8

In [18]:
df.to_csv("../datasets/alunos2.csv", sep=";", index=False)

In [19]:
df.to_excel("../datasets/alunos2_excel.xlsx")


5. Faça um programa que imprima o nome e a média de cada um dos
alunos do arquivo alunos.csv

6. Faça um programa que crie um arquivo media.csv e guarde o RA
(registro do aluno) junto com a respectiva média de cada um dos
alunos no arquivo alunos.csv.

_______
_______
_______

**Exemplo 2**: Metrô do RJ

<img src="https://rederiohoteis.com/wp-content/uploads/2018/06/2018-07-26-Metro-no-Rio-de-Janeiro-entenda-como-funciona-mapa.jpg" width=40% align=left>